Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.ErrorStatus Enumeration
 Define possible statuses for geometry creation/modification commands.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ErrorStatus
Public Enumeration ErrorStatus
Members
Member name | Value | Description
DataMissing | 0 |  Status when some part data is missing.
DefinitionPointsTooClose | 1 |  Status when definition points are too close.
DefinitionPointsCannotBeAligned | 2 |  Status when definition points are on line with sweep direction.
ZeroTotalRiseWithMore360Degrees | 3 |  Status when total rise is zero and rotation angle more than 360 degrees.
RotationAngleIs0Degrees | 4 |  Status when rotation angle is 0 degrees.
InvalidGeometry | 5 |  Status when helix has invalid geometry.
See Also
Reference
Tekla.Structures.Model Namespace